StoveOpt/tests/test_results/case_4166666667/0/details
Velocity
41.66666667